Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes Constructor
 Creates a new default dimension set base attributes instance that loads standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes()
Public Sub New
See Also
Reference
DimensionSetBaseAttributes Class
DimensionSetBaseAttributes Overload
Tekla.Structures.Drawing Namespace